Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal.c
/** @defgroup HAL_Exported_Functions_Group4 HAL SYSCFG configuration functions
  *  @brief    HAL SYSCFG configuration functions
  *
@verbatim
 ===============================================================================
                      ##### HAL SYSCFG configuration functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Set/Get memory mapping at address 0x00000000
      (+) Set/Get Ethernet physical interface
      (+) Set/Get remapping of TIM2 internal trigger1
      (+) Enable/Disable analog filter of I2C related IO
      (+) Enable/Disable GPIO Noise Filter
      (+) Enable/Disable GPIO Analog Mode
      (+) Start a hardware CCMSRAM erase operation
      (+) Enable CCMSRAM page write protection

@endverbatim
  * @{
  */

/**
  * @brief  Set memory mapping at address 0x00000000
  * @param  Memory This parameter can be one of the following values:
  *         @arg @ref SYSCFG_BOOT_MAINFLASH
  *         @arg @ref SYSCFG_BOOT_SYSTEMFLASH
  *         @arg @ref SYSCFG_BOOT_ESMC
  *         @arg @ref SYSCFG_BOOT_SRAM
  * @retval None
  */
void HAL_SYSCFG_SetRemapMemory(uint32_t Memory)
{
  MODIFY_REG(SYSCFG->CFGR[0], SYSCFG_CFGR1_MEM_MODE, Memory);
}

/**
  * @brief  Get memory mapping at address 0x00000000
  * @retval Returned value can be one of the following values:
  *         @arg @ref SYSCFG_BOOT_MAINFLASH
  *         @arg @ref SYSCFG_BOOT_SYSTEMFLASH
  *         @arg @ref SYSCFG_BOOT_ESMC
  *         @arg @ref SYSCFG_BOOT_SRAM
  */
uint32_t HAL_SYSCFG_GetRemapMemory(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_MEM_MODE));
}

/**
  * @brief  Set Ethernet physical interface.
  * @param  Interface This parameter can be one of the following values:
  *         @arg @ref SYSCFG_ETH_PHY_MII
  *         @arg @ref SYSCFG_ETH_PHY_RMII
  * @retval None
  */
void HAL_SYSCFG_SetETHPhysicalInterface(uint32_t Interface)
{
  MODIFY_REG(SYSCFG->CFGR[0], SYSCFG_CFGR1_ETH_PHYSEL, Interface);
}

/**
  * @brief  Get Ethernet physical interface.
  * @retval Returned value can be one of the following values:
  *         @arg @ref SYSCFG_ETH_PHY_MII
  *         @arg @ref SYSCFG_ETH_PHY_RMII
  */
uint32_t HAL_SYSCFG_GetETHPhysicalInterface(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_ETH_PHYSEL));
}

/**
  * @brief  Remap TIM2 internal trigger1
  * @note   Depending on devices and packages, some timers may not be available.
  *         Refer to device datasheet for timers availability.
  * @param  TIM2IneternalTrigger1 This parameter can be one of the following values:
  *         @arg @ref SYSCFG_TIM2_INTERNAL_TRIGGER1_NONE
  *         @arg @ref SYSCFG_TIM2_INTERNAL_TRIGGER1_USB1_SOF
  *         @arg @ref SYSCFG_TIM2_INTERNAL_TRIGGER1_USB2_SOF
  *         @arg @ref SYSCFG_TIM2_INTERNAL_TRIGGER1_ETH_PTP_INTR
  * @retval None
  */
void HAL_SYSCFG_SetRemapTIM2InternalTrigger1(uint32_t TIM2IneternalTrigger1)
{    
  /* Check the parameters */
  assert_param(IS_SYSCFG_TIM2_INTERNAL_TRIGGER1(TIM2IneternalTrigger1));
  MODIFY_REG(SYSCFG->CFGR[0], SYSCFG_CFGR1_TIM2ITR1_REMAP, TIM2IneternalTrigger1);
}

/**
  * @brief  Get remapping of TIM2 internal trigger1
  * @note   Depending on devices and packages, some timers may not be available.
  *         Refer to device datasheet for timers availability.
  * @retval Returned value can be one of the following values:
  *         @arg @ref SYSCFG_TIM2_INTERNAL_TRIGGER1_NONE
  *         @arg @ref SYSCFG_TIM2_INTERNAL_TRIGGER1_USB1_SOF
  *         @arg @ref SYSCFG_TIM2_INTERNAL_TRIGGER1_USB2_SOF
  *         @arg @ref SYSCFG_TIM2_INTERNAL_TRIGGER1_ETH_PTP_INTR
  */
uint32_t HAL_SYSCFG_GetRemapTIM2InternalTrigger1(void)
{
  return (READ_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_TIM2ITR1_REMAP));
}

/**
  * @brief  Enable analog filter of I2C related IO
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  I2CAnalogFilter This parameter can be a combination of the following values:
  *         @arg @ref SYSCFG_I2C_ANF_PA8
  *         @arg @ref SYSCFG_I2C_ANF_PA9
  *         @arg @ref SYSCFG_I2C_ANF_PA13
  *         @arg @ref SYSCFG_I2C_ANF_PA14
  *         @arg @ref SYSCFG_I2C_ANF_PA15
  *         @arg @ref SYSCFG_I2C_ANF_PB5
  *         @arg @ref SYSCFG_I2C_ANF_PB7
  *         @arg @ref SYSCFG_I2C_ANF_PB8
  *         @arg @ref SYSCFG_I2C_ANF_PB9
  *         @arg @ref SYSCFG_I2C_ANF_PC3
  *         @arg @ref SYSCFG_I2C_ANF_PC6
  *         @arg @ref SYSCFG_I2C_ANF_PC7
  *         @arg @ref SYSCFG_I2C_ANF_PC8
  *         @arg @ref SYSCFG_I2C_ANF_PC9
  *         @arg @ref SYSCFG_I2C_ANF_PC11
  *         @arg @ref SYSCFG_I2C_ANF_PF0
  * @retval None
  */
void HAL_SYSCFG_EnableI2CAnalogFilter(uint32_t I2CAnalogFilter)
{    
  /* Check the parameters */
  assert_param(IS_SYSCFG_I2C_ANF_IO(I2CAnalogFilter));
  SET_BIT(SYSCFG->CFGR[0],I2CAnalogFilter);
}

/**
  * @brief  Disable analog filter of I2C related IO
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  I2CAnalogFilter This parameter can be a combination of the following values:
  *         @arg @ref SYSCFG_I2C_ANF_PA8
  *         @arg @ref SYSCFG_I2C_ANF_PA9
  *         @arg @ref SYSCFG_I2C_ANF_PA13
  *         @arg @ref SYSCFG_I2C_ANF_PA14
  *         @arg @ref SYSCFG_I2C_ANF_PA15
  *         @arg @ref SYSCFG_I2C_ANF_PB5
  *         @arg @ref SYSCFG_I2C_ANF_PB7
  *         @arg @ref SYSCFG_I2C_ANF_PB8
  *         @arg @ref SYSCFG_I2C_ANF_PB9
  *         @arg @ref SYSCFG_I2C_ANF_PC3
  *         @arg @ref SYSCFG_I2C_ANF_PC6
  *         @arg @ref SYSCFG_I2C_ANF_PC7
  *         @arg @ref SYSCFG_I2C_ANF_PC8
  *         @arg @ref SYSCFG_I2C_ANF_PC9
  *         @arg @ref SYSCFG_I2C_ANF_PC11
  *         @arg @ref SYSCFG_I2C_ANF_PF0
  * @retval None
  */
void HAL_SYSCFG_DisableI2CAnalogFilter(uint32_t I2CAnalogFilter)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_I2C_ANF_IO(I2CAnalogFilter)); 
  CLEAR_BIT(SYSCFG->CFGR[0],I2CAnalogFilter);
}

/**
  * @brief  Enable GPIO Noise Filter
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (A..F) to select the GPIO peripheral for PY32E4 family
  * @param  GPIO_Pin specifies the pin to be Noise Filter
  *         This parameter can be any combination of GPIO_Pin_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_EnableGPIONoiseFilter(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOA)
  {    
    SET_BIT(SYSCFG->PAENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOB)
  {
    SET_BIT(SYSCFG->PBENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOC)
  {
    SET_BIT(SYSCFG->PCENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOD)
  {
    SET_BIT(SYSCFG->PDENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOE)
  {
    SET_BIT(SYSCFG->PEENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOF)
  {
    SET_BIT(SYSCFG->PFENS,GPIO_Pin);
  }
  else
  {
    
